dojodennis/xiaozhi-esp32/main/audio/audio_service.cc
    if (audio_engine_initialized_) {
        audio_engine_->EnableDeviceAec(enable);
    } else {
        ESP_LOGI(TAG, "Deferring AEC change until the audio engine is initialized");
    }
}

void AudioService::SetCallbacks(AudioServiceCallbacks& callbacks) { callbacks_ = callbacks; }

#if CONFIG_PROVISIONS_LOCAL_CAPTURE
bool AudioService::PlayLocalFeedback(const std::string_view& sound) {
    std::lock_guard<std::mutex> lock(audio_queue_mutex_);
    if (sound.empty() || sound.size() > 32768 || service_stopped_.load() ||
        local_recording_press_.load() != 0)
        return false;
    ++playback_generation_;
    audio_decode_queue_.clear();
    audio_playback_queue_.clear();
    local_feedback_ = sound;
    local_feedback_offset_ = 0;
    local_feedback_active_ = true;
    playback_drained_notified_ = false;
    audio_queue_cv_.notify_all();
    return true;
}

void AudioService::CancelLocalFeedback() {
    std::lock_guard<std::mutex> lock(audio_queue_mutex_);
    if (!local_feedback_active_)
        return;
    ++playback_generation_;
    local_feedback_ = {};
    local_feedback_active_ = false;
    audio_decode_queue_.clear();
    audio_playback_queue_.clear();
    audio_queue_cv_.notify_all();
}

void AudioService::FillLocalFeedbackLocked() {
    if (local_feedback_.empty())
        return;
    if (local_feedback_offset_ == 0)
        local_feedback_demuxer_.Reset();
    std::unique_ptr<AudioStreamPacket> packet;
    local_feedback_demuxer_.OnPacket(
        [&packet](const uint8_t* data, int rate, int duration, size_t size) {
            packet = std::make_unique<AudioStreamPacket>();
            packet->sample_rate = rate;
            packet->frame_duration = duration;
            packet->payload.assign(data, data + size);
        });
    // Parse only through the next packet, leaving compressed asset bytes in
    // flash. Playback backpressure never moves onto the caller or microphone.
    while (!packet && local_feedback_offset_ < local_feedback_.size() &&
           !local_feedback_demuxer_.HasError()) {
        const auto* byte =
            reinterpret_cast<const uint8_t*>(local_feedback_.data()) + local_feedback_offset_++;
        local_feedback_demuxer_.Process(byte, 1);
    }
    local_feedback_demuxer_.OnPacket({});
    if (local_feedback_offset_ == local_feedback_.size() || local_feedback_demuxer_.HasError())
        local_feedback_ = {};
    if (packet)
        audio_decode_queue_.push_back(std::move(packet));
}
#endif

void AudioService::PlaySound(const std::string_view& ogg) {
    if (!codec_->output_enabled()) {
        esp_timer_stop(audio_power_timer_);
        esp_timer_start_periodic(audio_power_timer_, AUDIO_POWER_CHECK_INTERVAL_MS * 1000);
        codec_->EnableOutput(true);
    }

    const auto* buf = reinterpret_cast<const uint8_t*>(ogg.data());
    size_t size = ogg.size();

    auto demuxer = std::make_unique<OggDemuxer>();
    demuxer->OnPacket(
        [this](const uint8_t* data, int sample_rate, int frame_duration_ms, size_t size) {
            auto packet = std::make_unique<AudioStreamPacket>();
            packet->sample_rate = sample_rate;
            packet->frame_duration = frame_duration_ms;
            packet->payload.resize(size);
            std::memcpy(packet->payload.data(), data, size);
            PushPacketToDecodeQueue(std::move(packet), true);
        });
    demuxer->Reset();
    demuxer->Process(buf, size);
}

bool AudioService::IsIdle() {
#if CONFIG_PROVISIONS_GATEWAY_REQUIRED
    if (local_recording_press_.load() != 0)
        return false;
#endif
    std::lock_guard<std::mutex> lock(audio_queue_mutex_);
    return audio_encode_queue_.empty() && IsPlaybackDrainedLocked() && audio_testing_queue_.empty();
}

bool AudioService::IsPlaybackIdle() {
    std::lock_guard<std::mutex> lock(audio_queue_mutex_);
    return IsPlaybackDrainedLocked();
}

void AudioService::ResetDecoder() {
    bool notify_drained = false;
    {
        std::lock_guard<std::mutex> lock(audio_queue_mutex_);
        ++playback_generation_;
#if CONFIG_PROVISIONS_LOCAL_CAPTURE
        local_feedback_ = {};
        local_feedback_active_ = false;
#endif
        std::unique_lock<std::mutex> decoder_lock(decoder_mutex_);
        if (opus_decoder_ != nullptr) {
            esp_opus_dec_reset(opus_decoder_);
        }
        decoder_lock.unlock();
        timestamp_queue_.clear();
        audio_decode_queue_.clear();
        audio_playback_queue_.clear();
        audio_testing_queue_.clear();
        notify_drained = MarkPlaybackDrainedLocked();
        audio_queue_cv_.notify_all();
    }
    if (notify_drained && callbacks_.on_playback_drained) {
        callbacks_.on_playback_drained();
    }
}

bool AudioService::IsPlaybackDrainedLocked() const {
#if CONFIG_PROVISIONS_LOCAL_CAPTURE
    if (!local_feedback_.empty())
        return false;
#endif
    return audio_decode_queue_.empty() && audio_playback_queue_.empty() && !decode_in_flight_ &&
           !output_in_flight_;
}

bool AudioService::MarkPlaybackDrainedLocked() {
    if (!IsPlaybackDrainedLocked() || playback_drained_notified_) {
        return false;
    }
    playback_drained_notified_ = true;
#if CONFIG_PROVISIONS_LOCAL_CAPTURE
    local_feedback_active_ = false;
#endif
    return true;
}

void AudioService::CheckAndUpdateAudioPowerState() {
    auto now = std::chrono::steady_clock::now();
    auto input_elapsed =
        std::chrono::duration_cast<std::chrono::milliseconds>(now - last_input_time_).count();
    auto output_elapsed =
        std::chrono::duration_cast<std::chrono::milliseconds>(now - last_output_time_).count();
    if (input_elapsed > AUDIO_POWER_TIMEOUT_MS && codec_->input_enabled()) {
        // ADC continuous start/stop must run in the same task. Wake the audio
        // input task instead of closing the codec from the esp_timer task.
        xEventGroupSetBits(event_group_, AS_EVENT_AUDIO_INPUT_STOP_REQUEST);
    }
    if (output_elapsed > AUDIO_POWER_TIMEOUT_MS && codec_->output_enabled()) {
        // Keep TX clock when duplex RX is active; otherwise RX may stall on some boards.
        if (!(codec_->duplex() && codec_->input_enabled())) {
            codec_->EnableOutput(false);
        }
    }
    if (!codec_->input_enabled() && !codec_->output_enabled()) {
        esp_timer_stop(audio_power_timer_);
    }
}

void AudioService::SetModelsList(srmodel_list_t* models_list) {
    if (audio_engine_initialized_ && models_list_ != models_list) {
        ESP_LOGW(TAG, "Ignoring speech model replacement after audio engine initialization");
        return;
    }
    models_list_ = models_list;
}

bool AudioService::IsAfeWakeWord() {
    return audio_engine_initialized_ && audio_engine_->IsAfeWakeWord();
}

bool AudioService::InitializeAudioEngine() {
    if (!audio_engine_) {
        return false;
    }
    if (audio_engine_initialized_) {
        return true;
    }
    if (!audio_engine_->Initialize(codec_, OPUS_FRAME_DURATION_MS, models_list_)) {
        ESP_LOGE(TAG, "Failed to initialize audio engine");
        return false;
    }
    audio_engine_initialized_ = true;
    audio_engine_->EnableDeviceAec(device_aec_enabled_);
    return true;
}
